namespace Patterns.FactoryMethod;


// Базовий клас фабрики. Зауважте, що "фабрика" — це всього лише
// додаткова роль для цього класу. Скоріше за все, він вже має
// якусь бізнес-логіку, яка потребує створення продуктів.
public abstract class Dialog
{
    public void Render()
    {
        // Щоб використати фабричний метод, ви маєте
        // пересвідчитися, що ця бізнес-логіка не залежить від
        // конкретних класів продуктів. Button — це загальний
        // інтейрфейс кнопок, тому все гаразд.
        var button = CreateButton();
        Console.WriteLine($"render of {button.Render()}");
        button.OnClick();
    }

    // Ми виносимо весь код створення продуктів до особливого
    // методу, який називають "фабричним".
    protected abstract IButton CreateButton();
}